Revit 2024 API
RailSupportsLayout Enumeration
 The layout of the rail supports.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum RailSupportsLayout
Visual Basic
Public Enumeration RailSupportsLayout
Visual C++
public enum class RailSupportsLayout
Members
Member name | Description
None |  No rail support.
FixedDistance |  The rail supports are laid out on a fixed distance spacing.
AlignWithRailingPosts |  The rail supports are laid out aligned with the railing posts.
FixedNumber |  The rail supports are laid out with a specified fixed number.
MaxSpacing |  The rail supports are laid out with a maximum spacing.
MinSpacing |  The rail supports are laid out with a minimum spacing.
See Also
Autodesk.Revit.DB.Architecture Namespace